import queue
import threading
import time

# Блокировка для потокобезопасного вывода в консоль.
lock = threading.Lock()

electronics = [(1, "смартфон"), (15, "ноутбук"), (7, "планшет"), (33, "камера"), (67, "гарнитура"),
               (4, "телевизор"), (21, "гаджет"), (83, "монитор"), (0, "роутер"), (47, "плеер")]


# Приоритетная очередь.
priority_queue = ...


# Функция для извлечения элемента очереди
def extractor():
    ...
    # Потокобезопасная печать
    with lock:
        print(f'Обработан "{el}"')


# Функция для постановки элемента в очередь
def loader(seq):
    ...


...